# -*- coding: utf-8 -*-
"""метод Неймана.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1csY5WNKTwm-iI6QO_MiQLBxkaXEVVp7I

Получить знания случайной величины в соотвествии с методом Неймана,если функция плотности распределения задана следующим образом:
f(x)=exp(-x)для x>=0
Построить гистограмму относительных частот и интегральную функцию распределения
Вычислить выборочное среднее,выборочную дисперсию,выборочное стандартное отклонение
"""

import numpy as np
import matplotlib.pyplot as plt
import scipy.stats as st

def density_func(x):
    return np.exp(-x)

# Генерация случайных чисел с использованием метода Неймана
N = 1000
x_values = []
while len(x_values) < N:
    x = np.random.uniform(0, 10)
    y = np.random.uniform(0, 1)
    if y <= density_func(x):
        x_values.append(x)

bins = 20
p1, bin, p = plt.hist(x_values, bins, density=True)
lia = 2
x = np.linspace(0, max(bin), 100)
fr = lia * np.exp(-lia * x)

y = st.expon.pdf(x, scale=1/lia)
plt.plot(x, y)
plt.show()

x = np.linspace(0, 10, 100)
y = st.expon.cdf(x, scale=1)

plt.plot(x, y)
plt.xlabel('x')
plt.show()

mean = np.mean(x_values)
variance = np.var(x_values)
deviation = np.std(x_values)

print('Выборочное среднее:', mean)
print('Выборочная дисперсия:', variance)
print('Стандартное отклонение:', deviation)

import numpy as np
import scipy.stats as st
import matplotlib.pyplot as plt
A=[0,4,0]
B=[1,1,2]
N=100
x=np.linspace(-8,8,N)
for i in range(3):
  y=st.norm.pdf(x,A[i],B[i])
  plt.plot(x,y)
plt.show

import numpy as np
import scipy.stats as st
import matplotlib.pyplot as plt


sigma=1
nu=0


x = np.linspace(-4, 4, 1000)
y = st.norm.pdf(x, nu, sigma)

plt.figure(figsize=(8, 6))
plt.plot(x, y, label='Probability density function')
plt.fill_between(x, 0, y, where=(x >= nu-3*sigma) & (x <= nu+3*sigma), alpha=0.3, label='Interval ')
plt.xlabel('Random Variable Value')
plt.ylabel('Probability Density')
plt.title('Standard Normal Distribution with Interval')
plt.legend()
plt.grid(True)
plt.show()

"""12.1

"""

import numpy as np
import matplotlib.pyplot as plt
import scipy.stats as stats

nu = 1.5
sigma = 1

x = np.linspace(-10, 15, 1000)

y = stats.norm.pdf(x, loc=nu, scale=sigma)
plt.figure(figsize=(8, 6))
plt.plot(x, y, label=f'Норм.распределение (p={nu}, c={sigma})')
plt.fill_between(x, 0, y, where=(x > 6), alpha=0.3)
plt.xlabel('Значение с в')
plt.ylabel('Плот. вероятности')
plt.title('Стандартное нормальное распределение с интервалом ')
plt.legend()
plt.grid(True)
plt.show()
probability = 1 - stats.norm.cdf(1, loc=nu, scale=sigma)
print(f"Вероятность P(X): {probability:.4f}")

import numpy as np
import matplotlib.pyplot as plt
import scipy.stats as st


n = 6

size = 10000

# 1.
random_var = np.random.uniform(0, 1, size=(size, n))
sum = np.sum(random_var, axis=1)

plt.figure(figsize=(8, 6))
plt.hist(sum, density=True)
plt.xlabel('Сумма 6 равн. с.в.')
plt.ylabel('Относит. частота')
plt.title('Гистограмма относит.частот суммы 6-ти с.в. равном. распределения')
plt.grid(True)
plt.show()

approximation = (sum - n / 2) / np.sqrt(n / 12)


mean = np.mean(approximation)
var = np.var(approximation)
sk = st.skew(approximation)
kurt = st.kurtosis(approximation)

# Вывод результатов
print(f"Выборочное среднее: {mean:.4f}")
print(f"Выборочная дисперсия: {var:.4f}")
print(f"Выборочная асимметрия: {sk:.4f}")
print(f"Выборочный эксцесс (по Фишеру): {kurt:.4f}")


plt.figure(figsize=(12, 6))
plt.subplot(1, 2, 1)
plt.hist(approximation, density=True, edgecolor='black')
plt.xlabel('Стандартная нормальная аппроксимация')
plt.ylabel('Относительная частота')
plt.title('Гистограмма станд нормальная аппроксимации')

plt.tight_layout()
plt.show()